-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Ноя 22 2019 г., 09:14
-- Версия сервера: 8.0.15
-- Версия PHP: 7.3.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `fivebot`
--

-- --------------------------------------------------------

--
-- Структура таблицы `games`
--

CREATE TABLE `games` (
  `id` int(255) NOT NULL,
  `degree` int(100) NOT NULL,
  `win` int(2) NOT NULL,
  `one` int(255) NOT NULL DEFAULT '0',
  `two` int(255) NOT NULL DEFAULT '0',
  `three` int(255) NOT NULL DEFAULT '0',
  `four` int(255) NOT NULL DEFAULT '0',
  `five` int(255) NOT NULL DEFAULT '0',
  `time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `games`
--

INSERT INTO `games` (`id`, `degree`, `win`, `one`, `two`, `three`, `four`, `five`) VALUES
(1, 115, 5, 0, 0, 0, 0, 0),
(2, 242, 3, 0, 0, 0, 0, 0),
(3, 107, 5, 0, 0, 0, 0, 0),
(4, 79, 5, 0, 0, 0, 0, 0),
(5, 150, 4, 0, 0, 0, 0, 0),
(6, 231, 3, 0, 0, 0, 0, 0),
(7, 147, 4, 0, 0, 0, 0, 0),
(8, 235, 3, 0, 0, 0, 0, 0),
(9, 253, 3, 0, 0, 0, 0, 0),
(10, 247, 3, 0, 0, 0, 0, 0),
(11, 161, 4, 0, 0, 0, 0, 0),
(12, 127, 5, 0, 0, 0, 0, 0),
(13, 261, 3, 0, 0, 0, 0, 0),
(14, 220, 3, 0, 0, 0, 0, 0),
(15, 270, 3, 0, 0, 0, 0, 0),
(16, 352, 2, 0, 0, 0, 0, 0),
(17, 52, 1, 0, 0, 0, 0, 0),
(18, 46, 1, 0, 0, 0, 0, 0),
(19, 7, 1, 0, 0, 0, 0, 0),
(20, 63, 1, 0, 0, 0, 0, 0),
(21, 101, 5, 0, 0, 0, 0, 0),
(22, 340, 2, 0, 0, 0, 0, 0),
(23, 165, 4, 0, 0, 0, 0, 0),
(24, 86, 5, 0, 0, 0, 0, 0),
(25, 14, 1, 0, 0, 0, 0, 0),
(26, 339, 2, 0, 0, 0, 0, 0),
(27, 153, 4, 0, 0, 0, 0, 0),
(28, 203, 4, 0, 0, 0, 0, 0),
(29, 295, 2, 0, 0, 0, 0, 0),
(30, 241, 3, 0, 0, 0, 0, 0),
(31, 355, 1, 0, 0, 0, 0, 0),
(32, 198, 4, 0, 0, 0, 0, 0),
(33, 64, 1, 0, 0, 0, 0, 0),
(34, 76, 5, 0, 0, 0, 0, 0),
(35, 348, 2, 0, 0, 0, 0, 0),
(36, 347, 2, 0, 0, 0, 0, 0),
(37, 277, 3, 0, 0, 0, 0, 0),
(38, 45, 1, 0, 0, 0, 0, 0),
(39, 203, 4, 0, 0, 0, 0, 0),
(40, 39, 1, 0, 0, 0, 0, 0),
(41, 305, 2, 0, 0, 0, 0, 0),
(42, 59, 1, 0, 0, 0, 0, 0),
(43, 273, 3, 0, 0, 0, 0, 0),
(44, 9, 1, 0, 0, 0, 0, 0),
(45, 6, 1, 0, 0, 0, 0, 0),
(46, 113, 5, 0, 0, 0, 0, 0),
(47, 197, 4, 0, 0, 0, 0, 0),
(48, 339, 2, 0, 0, 0, 0, 0),
(49, 354, 1, 0, 0, 0, 0, 0),
(50, 334, 2, 0, 0, 0, 0, 0),
(51, 25, 1, 0, 0, 0, 0, 0),
(52, 307, 2, 0, 0, 0, 0, 0),
(53, 287, 2, 0, 0, 0, 0, 0),
(54, 85, 5, 0, 0, 0, 0, 0),
(55, 196, 4, 0, 0, 0, 0, 0),
(56, 13, 1, 0, 0, 0, 0, 0),
(57, 51, 1, 0, 0, 0, 0, 0),
(58, 241, 3, 0, 0, 0, 0, 0),
(59, 62, 1, 0, 0, 0, 0, 0),
(60, 196, 4, 0, 0, 0, 0, 0),
(61, 115, 5, 0, 0, 0, 0, 0),
(62, 225, 3, 0, 0, 0, 0, 0),
(63, 112, 5, 0, 0, 0, 0, 0),
(64, 147, 4, 0, 0, 0, 0, 0),
(65, 212, 3, 0, 0, 0, 0, 0),
(66, 287, 2, 0, 0, 0, 0, 0),
(67, 7, 1, 0, 0, 0, 0, 0),
(68, 100, 5, 0, 0, 0, 0, 0),
(69, 131, 5, 0, 0, 0, 0, 0),
(70, 129, 5, 0, 0, 0, 0, 0),
(71, 338, 2, 0, 0, 0, 0, 0),
(72, 179, 4, 0, 0, 0, 0, 0),
(73, 353, 1, 0, 0, 0, 0, 0),
(74, 0, 1, 0, 0, 0, 0, 0),
(75, 231, 3, 0, 0, 0, 0, 0),
(76, 81, 5, 0, 0, 0, 0, 0),
(77, 91, 5, 0, 0, 0, 0, 0),
(78, 298, 2, 0, 0, 0, 0, 0),
(79, 133, 5, 0, 0, 0, 0, 0),
(80, 302, 2, 0, 0, 0, 0, 0),
(81, 27, 1, 0, 0, 0, 0, 0),
(82, 115, 5, 0, 0, 0, 0, 0),
(83, 257, 3, 0, 0, 0, 0, 0),
(84, 32, 1, 0, 0, 0, 0, 0),
(85, 60, 1, 0, 0, 0, 0, 0),
(86, 206, 4, 0, 0, 0, 0, 0),
(87, 59, 1, 0, 0, 0, 0, 0),
(88, 263, 3, 0, 0, 0, 0, 0),
(89, 243, 3, 0, 0, 0, 0, 0),
(90, 15, 1, 0, 0, 0, 0, 0),
(91, 190, 4, 0, 0, 0, 0, 0),
(92, 319, 2, 0, 0, 0, 0, 0),
(93, 2, 1, 0, 0, 0, 0, 0),
(94, 17, 1, 0, 0, 0, 0, 0),
(95, 96, 5, 0, 0, 0, 0, 0),
(96, 166, 4, 0, 0, 0, 0, 0),
(97, 91, 5, 0, 0, 0, 0, 0),
(98, 74, 5, 0, 0, 0, 0, 0),
(99, 133, 5, 0, 0, 0, 0, 0),
(100, 214, 3, 0, 0, 0, 0, 0),
(101, 49, 1, 0, 0, 0, 0, 0),
(102, 141, 4, 0, 0, 0, 0, 0),
(103, 224, 3, 0, 0, 0, 0, 0),
(104, 179, 4, 0, 0, 0, 0, 0),
(105, 235, 3, 0, 0, 0, 0, 0),
(106, 92, 5, 0, 0, 0, 0, 0),
(107, 297, 2, 0, 0, 0, 0, 0),
(108, 5, 1, 0, 0, 0, 0, 0),
(109, 309, 2, 0, 0, 0, 0, 0),
(110, 206, 4, 0, 0, 0, 0, 0),
(111, 227, 3, 0, 0, 0, 0, 0),
(112, 350, 2, 0, 0, 0, 0, 0),
(113, 153, 4, 0, 0, 0, 0, 0),
(114, 45, 1, 0, 0, 0, 0, 0),
(115, 14, 1, 0, 0, 0, 0, 0),
(116, 353, 1, 0, 0, 0, 0, 0),
(117, 337, 2, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(255) NOT NULL,
  `login` varchar(100) NOT NULL DEFAULT '',
  `password` varchar(100) NOT NULL DEFAULT '',
  `name` varchar(100) NOT NULL DEFAULT '',
  `token` varchar(999) DEFAULT '',
  `balance` int(255) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `password`, `name`, `token`, `balance`) VALUES
(1, 'lexspeedkb', 'lexus2001', 'Алексей Пилипенко', 'cPp9btun08Qqb7aPPnex01beJ8jb7f5YflP6cmEjtgUUDcaOjGr7nyv6rWsSUBfQPYIpXpWykpLl5cenW2iQU5b0iP4tq3b7fqpz', 0);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `games`
--
ALTER TABLE `games`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `games`
--
ALTER TABLE `games`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=118;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
